export default {
  projections: {
    ДокументE: {
      iD: {
        __caption__: 'ID'
      },
      описание: {
        __caption__: 'Описание'
      },
      тЧ: {
        __caption__: 'ТЧ',
        строка: {
          __caption__: 'Строка'
        },
        количество: {
          __caption__: 'Количество'
        },
        сумма: {
          __caption__: 'Сумма'
        },
        сотрудник: {
          __caption__: 'ФИО',
          фИО: {
            __caption__: 'ФИО'
          },
          должность: {
            __caption__: '',
            должность: {
              __caption__: 'Должность'
            }
          }
        }
      }
    },
    ДокументL: {
      iD: {
        __caption__: 'ID'
      },
      описание: {
        __caption__: 'Описание'
      },
      тЧ: {
        __caption__: 'Табл часть',
        строка: {
          __caption__: 'Строка'
        },
        количество: {
          __caption__: 'Количество'
        },
        сумма: {
          __caption__: 'Сумма'
        },
        сотрудник: {
          __caption__: 'Фамилия имя отчество',
          фИО: {
            __caption__: 'Фамилия имя отчество'
          },
          должность: {
            __caption__: '',
            должность: {
              __caption__: 'Должность'
            }
          }
        }
      }
    }
  },
  validations: {
    iD: {
      __caption__: 'iD'
    },
    описание: {
      __caption__: 'описание'
    },
    тЧ: {
      __caption__: 'тЧ'
    }
  }
};
