export default {
  projections: {
    ТЧE: {
      строка: {
        __caption__: 'Строка'
      },
      количество: {
        __caption__: 'Количество'
      },
      сумма: {
        __caption__: 'Сумма'
      },
      сотрудник: {
        __caption__: 'ФИО',
        фИО: {
          __caption__: 'ФИО'
        },
        должность: {
          __caption__: '',
          должность: {
            __caption__: 'Должность'
          }
        }
      }
    }
  },
  validations: {
    количество: {
      __caption__: 'количество'
    },
    строка: {
      __caption__: 'строка'
    },
    сумма: {
      __caption__: 'сумма'
    },
    сотрудник: {
      __caption__: 'ФИО'
    },
    документ: {
      __caption__: 'документ'
    }
  }
};
